circuitbreaker/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 8;

method          hierarchical;
//method          scotch;

simpleCoeffs
{
    n               (3 2 2);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (2 2 2);
    delta           0.001;
    order           xyz;
}


manualCoeffs
{
    dataFile        "cellDecomposition";
}


// ************************************************************************* //
